Test/Performance/artillery.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 20
      arrivalRate: 10
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - post:
        url: "/user"
        json: 
          name: "Diego Test"
          email: "huehue@test.com"
          password: "weofijew"